<a href="https://colab.research.google.com/github/guelpman/Priorizacion_Descuentos_Peru/blob/main/AnalisisDescriptivoRetoPeru.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import os

In [2]:
import numpy as np

In [12]:
### Importamos los data set --- 
urlpath = "https://raw.githubusercontent.com/IrisMon/Priorizacion_Descuentos_Peru/main/"
filename = "executed_promos.csv"
fullpath = os.path.join(urlpath, filename)
df_executed_promos= pd.read_csv(fullpath)
df_executed_promos.head()

   CodigoDC  Cliente  Marca  Cupo
0    297601     8410     29     9
1    297601     9337     29     9
2    309843     7404     40    16
3    309874     4017     40    16
4    309910     6316     40    16

In [17]:
### Importamos los data set clients_attributes
filename = "clients_attributes.csv"
fullpath = os.path.join(urlpath, filename)
df_clients_attributes= pd.read_csv(fullpath)
df_clients_attributes.head()

   Cliente FechaAltaCliente  Region  ...  TipoPoblacion  Estrato  EF
0        1       2009-03-03       4  ...              1        1   1
1        9       2009-03-03       4  ...              2        3   1
2       15       2009-03-03       4  ...              2        3   0
3       37       2009-03-03       4  ...              2        3   1
4       43       2009-03-03       4  ...              2        3   0

[5 rows x 8 columns]

In [14]:
### Importamos los data set active_promos
urlpath = "https://raw.githubusercontent.com/IrisMon/Priorizacion_Descuentos_Peru/main/"
filename = "active_promos.csv"
fullpath = os.path.join(urlpath, filename)
df_active_promos= pd.read_csv(fullpath)
df_active_promos.head()

   CodigoDC  Marca  Cupo Fecha_Desde Fecha_Hasta  Cliente
0    297601     29     9  2018-08-06  2018-08-30     3213
1    297601     29     9  2018-08-06  2018-08-30     3795
2    297601     29     9  2018-08-06  2018-08-30    11816
3    298856     40    16  2018-08-12  2018-08-19     8444
4    309916     40    16  2018-08-12  2018-08-19     8488

In [16]:
### Importamos los data set active_promos
urlpath = "https://raw.githubusercontent.com/IrisMon/Priorizacion_Descuentos_Peru/main/"
filename = "sales.csv"
fullpath = os.path.join(urlpath, filename)
df_sales= pd.read_csv(fullpath,encoding='ISO-8859-1')
df_sales.head()

   Cliente   Año  Mes  ClaseEnvase  ...  Cupo        Nr    Hl    Dcto
0        1  2018    1            2  ...  10.0   6352.94  0.03     0.0
1        1  2018    1            2  ...  16.0  99130.50  0.45     0.0
2        1  2018    6            2  ...   6.0  11605.40  0.07 -2880.0
3        1  2018    7            1  ...  34.0   1944.01  0.01     0.0
4        1  2018    8            2  ...  16.0  16250.18  0.06     0.0

[5 rows x 10 columns]